{"0":{"sourceName":"wired","url":"https:\/\/www.wired.com\/story\/us-lawyers-dont-buy-huaweis-argument-chinese-hacking\/","title":"US Lawyers Don’t Buy Huawei’s Argument on Chinese Hacking","clust":2,"description":"Huawei says Chinese law prohibits the government from ordering it to install backdoors for spying. US lawyers say a law's text isn't always the final word in China.","date":"Mar 04, 2019"},"1":{"sourceName":"techcrunch","url":"http:\/\/techcrunch.com\/2019\/03\/01\/canadian-government-allows-huawei-cfos-us-extradition-case-to-proceed-%e2%80%a8\/","title":"Canadian government allows Huawei CFO’s US extradition case to proceed","clust":0,"description":"Late last year, Huawei CFO Meng Wanzhou was arrested in Vancouver, Canada over alleged violations of U.S. trade sanctions with Iran. This week, the Canadian government announced that it will allow for the executive’s extradition to proceed Officials in the De…","date":"Mar 01, 2019"},"2":{"sourceName":"techcrunch","url":"http:\/\/techcrunch.com\/2019\/03\/04\/huawei-reportedly-plans-to-sue-us-government-over-ban\/","title":"Huawei reportedly plans to sue US government over ban","clust":0,"description":"Huawei’s already proven that a ban in the world’s second largest smartphone market won’t hamper its rapid success, but the company still won’t go down in the States without a fight. Word is that the consumer electronics giant is planning to unveil a lawsuit a…","date":"Mar 04, 2019"},"3":{"sourceName":"techcrunch","url":"http:\/\/techcrunch.com\/2019\/03\/06\/huawei-sues-us-government\/","title":"Huawei is suing the the US government over “unconstitutional” equipment ban","clust":1,"description":"Huawei has decided to go on the legal offence against the United States government after defending itself against alleged espionage and bank frauds linked to American sanctions on Iran. During a press conference late Wednesday, Huawei announced that it has fi…","date":"Mar 07, 2019"},"4":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/huaweis-wild-week-ends-with-canada-approving-extraditio-1832999229","title":"Huawei's Wild Week Ends With Canada Approving Extradition Hearing for Top Executive","clust":0,"description":"Huawei’s ongoing battle with the U.S. government suffered a significant blow on Friday when Canadian authorities ruled that an extradition hearing for the Chinese company’s CFO, Meng Wanzhou, can move forward. The decision capped a week in which Huawei has ex…","date":"Mar 01, 2019"},"5":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/china-says-two-canadian-citizens-are-spies-as-extraditi-1833035137","title":"China Says Two Canadian Citizens Are Spies as Extradition of Huawei Exec Moves Forward","clust":0,"description":"The Chinese government has formally accused two Canadian citizens, Michael Kovrig and Michael Spavor, of spying and stealing “state secrets,” according to a new report in the Washington Post. The charges come on the heels of a Canadian court’s ruling on Frida…","date":"Mar 04, 2019"},"6":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/huawei-now-just-trolling-u-s-by-dredging-up-nsa-spying-1832925885","title":"Huawei Now Just Trolling U.S. by Dredging Up Edward Snowden","clust":2,"description":"“Prism, prism on the wall, who’s the most trustworthy of them all?” said Huawei’s rotating chairman Guo Ping on stage on Tuesday at Mobile World Congress 2019. But Guo wasn’t talking about Snow White. He was poking fun at the massive surveillance programs mai…","date":"Feb 27, 2019"},"7":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/chinese-tech-giant-huawei-plans-to-sue-the-us-governmen-1833030662","title":"Chinese Tech Giant Huawei Plans to Sue the US Government: Report","clust":2,"description":"Chinese telecom firm Huawei has recently come under intense pressure in the U.S. to prove that the company isn’t spying for the Chinese government. But if a new report is accurate, Huawei is ready to push back. Hard. Read more...","date":"Mar 04, 2019"},"8":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/huawei-ceo-says-u-s-just-isnt-that-important-pinky-sw-1832724421","title":"Huawei CEO Says U.S. Just Isn't That Important, Pinky-Swears Not to Spy on 5G Network","clust":1,"description":"Amid a firestorm of legal and political salvoes fired at Huawei by the U.S. government, Huawei CEO Ren Zhengfei insisted this week that “there’s no way the U.S. can crush us” while denying that his company will give China’s government backdoor access to its n…","date":"Feb 19, 2019"},"9":{"sourceName":"mashable","url":"https:\/\/mashable.com\/article\/huawei-founder-bbc-interview\/","title":"Huawei founder speaks amid pressure: 'The U.S. can't crush us'","clust":1,"description":"The founder of Chinese electronics giant Huawei said it doesn't need the U.S. to survive. Ren Zhengfei spoke to the BBC in his first interview since the arrest of his daughter, Huawei CFO Wanzhou Meng, in Canada. SEE ALSO: Smartphones will get a lot more inte…","date":"Feb 19, 2019"},"10":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/03\/04\/world\/canada\/huawei-canada-meng-wanzhou.html","title":"Meng Wanzhou, Seen as ‘Poor Little Rich Girl,’ Proves a Polarizing Detainee","clust":2,"description":"Protesting outside the Supreme Court of British Columbia in Vancouver, during the third day of the December bail hearing for Meng Wanzhou, the chief financial officer of Huawei.","date":"Mar 04, 2019"},"11":{"sourceName":"bbc","url":"https:\/\/www.bbc.co.uk\/news\/business-47478587","title":"Huawei sues US government over product ban","clust":2,"description":"The Chinese firm is facing international scrutiny tied to concerns over the security of its products.","date":"Mar 07, 2019"},"12":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-china-huawei-tech-idUSKCN1QN2A8","title":"Long before Trump’s trade war with China, Huawei’s activities were secretly tracked","clust":2,"description":"The surprise arrest of Huawei's chief financial officer in December quickly turned the executive, Meng Wanzhou, into a central figure in a trade war between two economic superpowers.","date":"Mar 06, 2019"},"13":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-china-huawei-tech-idUSKCN1QK0RW","title":"Huawei CFO suing Canada over December arrest","clust":0,"description":"The lawyers for Huawei Chief Financial Officer Meng Wanzhou are suing the Canadian government, its border agency and federal police, alleging their client was detained, searched and interrogated for three hours in violation of her constitutional rights.","date":"Mar 03, 2019"},"14":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-china-huawei-tech-extradition-idUSKCN1QI5C7","title":"Canada to allow extradition case against Huawei executive","clust":1,"description":"The Canadian government, as expected, said on Friday it would allow an extradition hearing to proceed against Meng Wanzhou, the chief financial officer of Huawei Technologies Co Ltd who was detained in Canada late last year.","date":"Mar 01, 2019"},"15":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-china-huawei-tech-idUSKCN1QL1X4","title":"China charges Canadian, Huawei to sue as spat escalates","clust":2,"description":"China's government and its leading smartphone maker Huawei Technologies Ltd on Monday stepped up pressure on U.S. and Canadian governments in a dispute over market access that has ensnared Huawei's CFO, who faces U.S. criminal charges.","date":"Mar 04, 2019"},"16":{"sourceName":"androidcentral","url":"https:\/\/www.androidcentral.com\/huawei-goes-offensive-sues-us-government-over-hardware-sales-ban","title":"Huawei goes on offensive, sues U.S. government over hardware sales ban","clust":0,"description":"Huawei is trying to turn the tide in its fight against the U.S. government's ban on its network equipment, which has effectively shut down the company's sales in the country. During a press conference in Shenzhen on Thursday morning, the company announced tha…","date":"Mar 07, 2019"},"17":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/world\/2019\/mar\/04\/monday-briefing-cash-for-hard-hit-towns-branded-brexit-bribe","title":"Monday briefing: Cash for hard-hit towns branded 'Brexit bribe'","clust":2,"description":"Labour says PM’s £1.6bn funding boost won’t ease impact of austerity … Javid to meet police chiefs to discuss knife crime … the last days of Isis Good morning briefers. I’m Martin Farrer and these are the top stories on the first Monday of March. Continue rea…","date":"Mar 04, 2019"},"18":{"sourceName":"cnet","url":"https:\/\/www.cnet.com\/news\/huawei-founder-says-theres-no-way-the-us-can-crush-us\/","title":"Huawei founder says 'there's no way the US can crush us' - CNET","clust":1,"description":"Ren Zhengfei tells the BBC the world needs Huawei because it's \"more advanced.\" He also denies spying allegations.","date":"Feb 19, 2019"},"19":{"sourceName":"cnet","url":"https:\/\/www.cnet.com\/news\/at-mwc-2019-5g-and-foldable-smartphones-go-big\/","title":"At MWC 2019, 5G and foldable smartphones go big - CNET","clust":0,"description":"With international intrigue and a 5G coming-out party, this show doesn’t need the boost of a Samsung event.","date":"Feb 22, 2019"},"20":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/uk-to-mitigate-risks-of-huawei-equipment-in-5g-technology-2019-2","title":"UK reportedly concludes it can mitigate risks associated with the use of Huawei equipment in 5G networks","clust":2,"description":"Antonio Villas-Boas\/Business Insider The British government has decided it can mitigate the risks arising from the use of Huawei Technologies in 5G networks, the Financial Times reported on Sunday. Huawei, along with another Chinese network equipment company …","date":"Feb 18, 2019"},"21":{"sourceName":"macrumors","url":"https:\/\/www.macrumors.com\/2019\/02\/18\/huaweis-efforts-to-steal-apple\/","title":"Huawei's Efforts to Steal Apple Trade Secrets Include Employee Bonus Program and Other Dubious Tactics","clust":0,"description":"Last month, the United States Justice Department announced a series of criminal charges against Chinese smartphone maker Huawei for stealing trade secrets, bank fraud, wire fraud, and obstructing justice. Today, The Information has shed light on Huawei's tact…","date":"Feb 18, 2019"},"22":{"sourceName":"slashdot","url":"https:\/\/news.slashdot.org\/story\/19\/02\/19\/2128204\/the-us-cannot-crush-us-says-huawei-founder","title":"The US Cannot Crush Us, Says Huawei Founder","clust":2,"description":"The founder of Huawei has said there is \"no way the US can crush\" the company, in an interview with the BBC. From the report: Ren Zhengfei, founder and president of Huawei, described the arrest of his daughter Meng Wanzhou, the company's chief financial offic…","date":"Feb 19, 2019"},"23":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/huawei-founder-ren-zhengfei-defiant-message-to-us-2019-2","title":"'There's no way the US can crush us': Huawei’s founder issued a defiant message to Trump's administration","clust":2,"description":"Huawei founder Ren Zhengfei gave a rare interview to the BBC on Monday, declaring that there's \"no way the US can crush us.\" Ren's daughter, Huawei CFO Meng Wanzhou, was arrested in Canada in December last year. He said the arrest was \"politically motivated\" …","date":"Feb 19, 2019"},"24":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/mike-pompeo-slams-huawei-on-his-european-tour-2019-2","title":"Mike Pompeo is bringing the hammer down on Huawei on his European tour","clust":2,"description":"Mike Pompeo has urged allied countries to cut ties with Chinese phone giant Huawei while on his European tour on Monday. Speaking in Hungary, Pompeo said it makes it \"more difficult\" for the US to partner with nations if they don't distance themselves from Hu…","date":"Feb 12, 2019"},"25":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/10-things-in-tech-you-need-to-know-today-february-19-2019-2","title":"10 things in tech you need to know today","clust":1,"description":"Good morning! This is the tech news you need to know this Tuesday. The founder of Huawei said \"there's no way the US can crush us,\" in an interview with the BBC. Ren Zhengfei spoke about the arrest of his daughter and CFO Meng Wanzhou. A report from UK lawmak…","date":"Feb 19, 2019"},"26":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/huawei-how-allies-are-reacting-to-us-calls-to-avoid-the-tech-firm-2019-2","title":"Trump's administration is warning US allies to stay away from a powerful Chinese company — but not everyone's listening","clust":2,"description":"The US and Chinese phone giant Huawei are at each other's throats. America claims Huawei is used as a backdoor for the Chinese government to spy. Huawei denies this. The US has been lobbying allies to reject Huawei's 5G technology, but not everyone's listenin…","date":"Mar 03, 2019"},"27":{"sourceName":"pcmag","url":"https:\/\/www.pcmag.com\/news\/366455\/unpacking-trumps-american-ai-initiative","title":"President Trump Signs Executive Order Establishing the 'American AI Initiative'","clust":0,"description":"The plan is light on details and loaded with China subtext.","date":"Feb 12, 2019"},"28":{"sourceName":"ctvnews","url":"https:\/\/www.ctvnews.ca\/politics\/arrested-huawei-executive-meng-wanzhou-returns-to-b-c-court-today-1.4324137","title":"Arrested Huawei executive Meng Wanzhou returns to B.C. court today - CTV News","clust":1,"description":"Arrested Huawei executive Meng Wanzhou returns to B.C. court today CTV News Meng Wanzhou, the chief financial officer of Huawei Technologies, is set to return to British Columbia Supreme Court today. View full coverage on Google News","date":"Mar 06, 2019"},"29":{"sourceName":"ctvnews","url":"https:\/\/www.ctvnews.ca\/politics\/meng-wanzhou-extradition-case-raises-serious-concerns-defence-lawyer-says-1.4324137","title":"Arrested Huawei executive Meng Wanzhou returns to B.C. court today - CTV News","clust":1,"description":"Arrested Huawei executive Meng Wanzhou returns to B.C. court today CTV News Meng Wanzhou, the chief financial officer of Huawei Technologies, is set to return to British Columbia Supreme Court today. View full coverage on Google News","date":"Mar 06, 2019"},"30":{"sourceName":"canoe","url":"https:\/\/canoe.com\/news\/national\/huawei-cfo-meng-wangzhou-suing-canada-its-border-agency-and-the-rcmp","title":"Huawei CFO Meng Wangzhou suing Canada, its border agency and the RCMP - Toronto Sun","clust":2,"description":"Huawei CFO Meng Wangzhou suing Canada, its border agency and the RCMP Toronto Sun Meng Wanzhou files civil claim against CBSA, RCMP and federal government CBC News As Huawei extradition looms, China slams Canada over SNC-Lavalin CTV News Huawei Exec Meng Wanz…","date":"Mar 03, 2019"},"31":{"sourceName":"theglobeandmail","url":"https:\/\/www.theglobeandmail.com\/canada\/british-columbia\/article-huawei-executive-meng-wanzhou-files-lawsuit-alleging-breach-of\/","title":"Huawei executive Meng Wanzhou files lawsuit alleging breach of constitutional rights - The Globe and Mail","clust":2,"description":"Huawei executive Meng Wanzhou files lawsuit alleging breach of constitutional rights The Globe and Mail China accuses detained Canadians of spying, days after Huawei extradition hearing approved The Globe and Mail Huawei CFO Meng Wanzhou sues Canadian governm…","date":"Mar 03, 2019"},"32":{"sourceName":"theglobeandmail","url":"https:\/\/www.theglobeandmail.com\/politics\/article-canada-allows-extradition-hearing-against-huawei-executive-meng\/","title":"Canada allows extradition hearings against Huawei executive Meng - The Globe and Mail","clust":2,"description":"Canada allows extradition hearings against Huawei executive Meng The Globe and Mail Canada announces extradition hearing against Meng Wanzhou can go ahead CBC News Canada allows extradition case against Huawei CFO to proceed CTV News Canada approves Huawei ex…","date":"Mar 01, 2019"},"33":{"sourceName":"globalnews","url":"https:\/\/globalnews.ca\/news\/5011691\/china-canada-judicial-independence-snc-lavalin\/","title":"China questions Canada’s judicial independence amid SNC-Lavalin controversy - Global News","clust":2,"description":"China questions Canada’s judicial independence amid SNC-Lavalin controversy Global News China's Foreign Ministry grabbed a chance to question the state of judicial independence in Canada on Friday, as Prime Minister Justin Trudeau's government... View full co…","date":"Mar 01, 2019"},"34":{"sourceName":"ctvnews","url":"https:\/\/www.ctvnews.ca\/politics\/china-says-fears-of-insect-infestation-behind-barring-of-canadian-canola-1.4324242","title":"China says fears of insect infestation behind barring of Canadian canola - CTV News","clust":1,"description":"China says fears of insect infestation behind barring of Canadian canola CTV News China halts canola shipments from major Canadian supplier CBC News U.S. hopes to force Meng Wanzhou to spill on Huawei, say former federal prosecutors Toronto Star The stakes ju…","date":"Mar 06, 2019"},"35":{"sourceName":"ctvnews","url":"https:\/\/www.ctvnews.ca\/world\/china-accuses-two-detained-canadians-of-stealing-state-secrets-1.4321016","title":"Chinese state media: Detained Canadians stole state secrets - CTV News","clust":2,"description":"Chinese state media: Detained Canadians stole state secrets CTV News China's state news agency says two Canadians detained on suspicion of harming national security acted together to steal state secrets. View full coverage on Google News","date":"Mar 04, 2019"},"36":{"sourceName":"ctvnews","url":"https:\/\/www.ctvnews.ca\/5things\/5-things-to-know-for-tuesday-march-5-2019-1.4322618","title":"5 things to know for Tuesday, March 5, 2019 - CTV News","clust":0,"description":"5 things to know for Tuesday, March 5, 2019 CTV News Trudeau is facing a political civil war The Globe and Mail Most Canadians side with Wilson-Raybould, believe Trudeau has lost moral authority to govern: Ipsos poll Global News Jane Philpott resigns from cab…","date":"Mar 05, 2019"},"37":{"sourceName":"news","url":"https:\/\/ca.news.yahoo.com\/chinas-huawei-soft-power-push-111339593.html","title":"China's Huawei soft power push raises hard questions - Yahoo News Canada","clust":4,"description":"China's Huawei soft power push raises hard questions Yahoo News Canada Huawei’s charm offensive around the world raises hard questions amid spying allegations Global News China: No evidence Huawei a national security threat CTV News Huawei and 5G: A Case Stud…","date":"Feb 13, 2019"},"38":{"sourceName":"castanet","url":"https:\/\/www.castanet.net\/news\/Canada\/250512\/Big-Tobacco-to-pay-billions","title":"Big Tobacco to pay billions - Canada News - Castanet.net","clust":3,"description":"Big Tobacco to pay billions - Canada News Castanet.net Appeals Court upholds ruling ordering $17B in damages to Quebec smokers CTV News Tobacco Companies Ordered To Pay $15,000,000,000 To Smokers In Quebec MTL Blog Quebec Court of Appeal upholds ruling orderi…","date":"Mar 01, 2019"},"39":{"sourceName":"canoe","url":"https:\/\/canoe.com\/technology\/meet-the-mate-x-huawei-unveils-5g-phone-with-folding-screen","title":"Meet the Mate X: Huawei unveils 5G phone with folding screen - The London Free Press","clust":0,"description":"Meet the Mate X: Huawei unveils 5G phone with folding screen The London Free Press Huawei says Trump 'clear and correct' on 5G as trade deadline looms Reuters Canada Trump is right that the US risks losing the 5G race, Huawei chairman says CNBC Huawei v US in…","date":"Feb 24, 2019"},"40":{"sourceName":"edmontonjournal","url":"https:\/\/edmontonjournal.com\/news\/local-news\/get-back-on-the-job-notley-calls-for-trudeau-to-act-after-china-ban-hits-alberta-canola-producers","title":"'Get back on the job': Notley calls for Trudeau to act after China ban hits Alberta canola producers - Edmonton Journal","clust":2,"description":"'Get back on the job': Notley calls for Trudeau to act after China ban hits Alberta canola producers Edmonton Journal Premier Rachel Notley is demanding Prime Minister Justin Trudeau take action after China blocked some Canadian canola imports, a move which c…","date":"Mar 06, 2019"},"41":{"sourceName":"theglobeandmail","url":"https:\/\/www.theglobeandmail.com\/world\/article-uk-downplays-huawei-threat-dealing-a-blow-to-us-campaign-against\/","title":"U.K. downplays Huawei threat, deals blow to U.S. campaign against Chinese telecom giant - The Globe and Mail","clust":2,"description":"U.K. downplays Huawei threat, deals blow to U.S. campaign against Chinese telecom giant The Globe and Mail Britain concludes it can mitigate Huawei risk in 5G networks, newspaper says The Globe and Mail UK reportedly concludes it can mitigate risks associated…","date":"Feb 18, 2019"},"42":{"sourceName":"nationalpost","url":"https:\/\/nationalpost.com\/pmn\/news-pmn\/chinas-huawei-set-to-unveil-5g-phone-with-folding-screen","title":"China's Huawei set to unveil 5G phone with folding screen - Montreal Gazette","clust":2,"description":"China's Huawei set to unveil 5G phone with folding screen Montreal Gazette Huawei 'Mate X' foldable phone appears to be a thing at MWC 2019 CNET Trump is right that the US risks losing the 5G race, Huawei chairman says CNBC Huawei chairman says Trump's latest…","date":"Feb 24, 2019"},"43":{"sourceName":"theglobeandmail","url":"https:\/\/www.theglobeandmail.com\/opinion\/article-trudeau-has-lost-the-moral-mandate-to-govern\/","title":"Trudeau has lost the moral mandate to govern - The Globe and Mail","clust":0,"description":"Trudeau has lost the moral mandate to govern The Globe and Mail Scheer: Trudeau should resign over SNC-Lavalin affair Toronto Sun LILLEY: Wilson-Raybould drops a bomb on Trudeau Toronto Sun The moral catastrophe of Justin Trudeau Maclean's Wilson-Raybould say…","date":"Feb 28, 2019"},"44":{"sourceName":"castanet","url":"https:\/\/www.castanet.net\/news\/Canada\/248984\/Deer-walks-into-a-bar","title":"Deer walks into a bar - Canada News - Castanet.net","clust":0,"description":"Deer walks into a bar - Canada News Castanet.net Deer crashes through Ont. bar window CTV News Deer break through window of bar, damages politician’s office in Oshawa, Ont. CityNews Toronto 'Guess he was thirsty': Deer busts into Ont. bar CTV News Video shows…","date":"Feb 10, 2019"},"45":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/world\/2019\/mar\/04\/huawei-meng-wanzhou-sues-canadian-government-over-arrest","title":"Huawei: Meng Wanzhou sues Canadian government over arrest","clust":0,"description":"Chinese CFO claims she was detained and interrogated before being told she was under arrest Meng Wanzhou, the chief financial officers of Chinese tech giant Huawei, is suing the Canadian government, its border agency and the national police force over her hig…","date":"Mar 04, 2019"},"46":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/world\/2019\/mar\/07\/thursday-briefing-microplastic-scourge-spreads-everywhere","title":"Thursday briefing: Microplastic scourge spreads everywhere","clust":0,"description":"Toll on human health may not become clear for decades … Theresa May ranked as ‘populist’ world leader … and why anti-Zionist is not antisemitic Hello I’m Warren Murray and it’s Thursday, all day. Continue reading...","date":"Mar 07, 2019"},"47":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/world\/2019\/feb\/19\/tuesday-briefing-independent-group-aims-to-scoop-up-other-frustrated-mps","title":"Tuesday briefing: Independent Group aims to scoop up other frustrated MPs","clust":2,"description":"Warnings that more will quit Labour and Tories … British tourist and French companion missing in Australian surf … and swearing off new clothes Hello, it’s Warren Murray on a morning when “leave” and “remain” have taken on new meaning in the Labour party. Con…","date":"Feb 19, 2019"},"48":{"sourceName":"boingboing","url":"https:\/\/boingboing.net\/2019\/02\/20\/huawei-president-we-wont-sp.html","title":"Huawei president Ren Zhengfei: We won't spy on US even if Chinese law requires us to, what backdoors?","clust":2,"description":"In his first U.S. TV interview, Ren Zhengfei describes Huawei as “a tomato” crushed between two superpowers.","date":"Feb 20, 2019"},"49":{"sourceName":"boingboing","url":"https:\/\/boingboing.net\/2019\/02\/11\/political-sensitivities.html","title":"The most censored Wechat topics: US-China trade war, Canadian arrest of Huawei CFO, ZTE sanctions, more","clust":2,"description":"Wechatscope is a research project from the University of Hong Kong; they ingest every public status update on Wechat, the Chinese social network used by more than a billion people, then record which messages are later made unavailable, and infer from that the…","date":"Feb 11, 2019"},"50":{"sourceName":"thenextweb","url":"https:\/\/thenextweb.com\/?p=1187673","title":"Why Huawei CFO’s arrest is sparking tension between the US and China","clust":2,"description":"While Huawei is selling tons of phones worldwide, it’s facing a grim time in the US with plenty of lawsuits and governmental bans against it over surveillance concerns. Most notably, the company’s Chief Financial Officer, Meng Wanzhou, has been arrested and i…","date":"Feb 19, 2019"},"51":{"sourceName":"time","url":"http:\/\/time.com\/5542605\/meng-wanzhou-huawei-cfo-suing-canada\/","title":"Huawei CFO Meng Wanzhou Is Suing Canada Over Her Detention","clust":2,"description":"She alleges that agents interrogated her \"under the guise of a routine customs\" interview before telling her she was under arrest","date":"Mar 04, 2019"},"52":{"sourceName":"time","url":"http:\/\/time.com\/5528362\/china-wechat-censorship-wechatscope\/","title":"The U.S.-China Trade War and #MeToo Were Among the Most Censored Topics on China’s WeChat, Report Finds","clust":2,"description":"The U.S.-China trade war and #MeToo were among the most controversial posts on China's WeChat app, according to new research","date":"Feb 13, 2019"},"53":{"sourceName":"time","url":"http:\/\/time.com\/5543605\/china-accuses-canadians-stealing-state-secrets\/","title":"China Has Accused Two Detained Canadians of Stealing State Secrets","clust":2,"description":"The men were arrested in December after a senior Chinese tech exec was detained in Canada","date":"Mar 05, 2019"},"54":{"sourceName":"time","url":"http:\/\/time.com\/5540855\/us-china-trade-relationship\/","title":"Deal or no Deal, the U.S.-China Relationship Is Beyond Repair","clust":1,"description":"Are we nearing a deal to end the U.S.-China trade war? President Trump seems to think so. “We’re getting very, very close,” he told a group of governors visiting the White House in February. Citing “substantial progress” in recent negotiations, Trump postpone…","date":"Feb 28, 2019"},"55":{"sourceName":"time","url":"http:\/\/time.com\/5536191\/huawei-5g-folding-phone\/","title":"China’s Huawei Unveils New 5G Folding-Screen Phone","clust":0,"description":"China's Huawei unveiled a new folding-screen phone on Sunday, joining the latest trend for bendable devices as it challenges the market.","date":"Feb 24, 2019"},"56":{"sourceName":"time","url":"http:\/\/time.com\/5545587\/china-npc-parliament-economy-li-keqiang\/","title":"China Prepares for ‘Unpredictable’ Year Ahead at Subdued Annual Parliament","clust":2,"description":"If last year was the Xi Jinping show, the 2019 National People’s Congress has been all about the economy","date":"Mar 06, 2019"},"57":{"sourceName":"time","url":"http:\/\/time.com\/5546669\/china-huawei-equipment-ban-lawsuit\/","title":"Chinese Tech Giant Huawei Sues U.S. Over Equipment Ban","clust":2,"description":"Chinese tech giant Huawei is challenging a law that labels the company a security risk and would limit its access to the American market","date":"Mar 07, 2019"},"58":{"sourceName":"yahoo","url":"https:\/\/finance.yahoo.com\/news\/huawei-cfo-suing-canada-border-191414839.html","title":"Huawei CFO suing Canada, its border agency and the RCMP","clust":2,"description":"An executive of Chinese tech giant Huawei is suing the Canadian government, its border agency and the national police force, saying they detained, searched and interrogated her before telling her she was under arrest. Lawyers for Meng Wanzhou said Sunday they…","date":"Mar 04, 2019"},"59":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/huawei-founder-says-huawei-cfo-arrest-politically-motivated-032402726--finance.html","title":"Huawei founder says Huawei CFO arrest was politically motivated - BBC","clust":0,"description":"\"Firstly, I object to what the U.S. has done.  This kind of politically motivated act is not acceptable,\" Ren told the BBC in an interview.  Canada arrested Meng on Dec. 1 at the request of the United States.","date":"Feb 19, 2019"},"60":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/huawei-sue-us-banning-federal-124242805.html","title":"Huawei to sue US for banning federal agencies from using its products","clust":2,"description":"Huawei is preparing to sue the US government for banning federal agencies from using its technology, according to a new report. The Chinese firm is expected to file a lawsuit on Thursday accusing the US of acting unconstitutionally, The New York Times claims,…","date":"Mar 04, 2019"},"61":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/huawei-founder-says-apos-no-081820522.html","title":"Huawei Founder Says There's No Stopping China's Tech Giant, Despite U.S. Pressure","clust":1,"description":"Ren Zhengfei says there's \"no way the U.S. can crush\" the company","date":"Feb 19, 2019"},"62":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/evening-briefing-220016116.html","title":"Your Evening Briefing","clust":2,"description":"America doesn't have enough truck drivers to deliver what its people want to buy.  The shortage is starting to affect the retail prices of everything from kitty litter to My Little Pony figurines.  CEO Elon Musk even made strange changes to his Twitter accoun…","date":"Mar 01, 2019"},"63":{"sourceName":"slate","url":"https:\/\/slate.com\/business\/2019\/02\/why-donald-trump-tweeted-6g-china-huwei.html","title":"Trump’s Bizarre Tweet About China and 6G Wireless Tech, Unpacked","clust":0,"description":"Seemingly out of the blue, Donald Trump weighed in on the future of U.S. wireless technology Thursday morning.","date":"Feb 21, 2019"},"64":{"sourceName":"usatoday","url":"https:\/\/www.usatoday.com\/story\/tech\/2019\/02\/24\/chinas-huawei-unveils-5g-phone-with-folding-screen\/39107565\/?utm_source=google&utm_medium=amp&utm_campaign=speakable","title":"China's Huawei unveils Mate X 5G phone with folding screen and $2,600 price","clust":2,"description":"Ready for more pricey foldable phones? Huawei on Sunday introduced its Mate X, a $2,600 rival to Samsung's Galaxy Fold.","date":"Feb 24, 2019"},"65":{"sourceName":"digitaltrends","url":"https:\/\/www.digitaltrends.com\/android\/huawei-flles-lawsuit-against-us-government\/","title":"Huawei sues the U.S. government over a sales ban on its equipment and services","clust":1,"description":"Huawei has filed a lawsuit against the U.S. government, claiming that its efforts to block the Chinese company from selling telecom equipment to federal agencies is unconstitutional. The lawsuit was issued in Texas, where Huawei's U.S. headquarters is based.","date":"Mar 07, 2019"},"66":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/canada-begins-process-extraditing-huawei-exec-us-193523993.html","title":"Canada begins process of extraditing Huawei exec to US","clust":2,"description":"Canada's justice department on Friday began the process of extraditing Huawei executive Meng Wanzhou to the United States to face criminal charges related to alleged Iran sanctions violations. \"Today, Department of Justice Canada officials issued an Authority…","date":"Mar 01, 2019"},"67":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/china-accuses-two-detained-canadian-182022628.html","title":"China accuses two detained Canadian men of spying","clust":2,"description":"China has accused two detained Canadians of spying, intensifying a diplomatic row between the two countries. It came just days after Canada announced it will proceed with a request from the United States to extradite Meng Wanzhou, chief financial officer of t…","date":"Mar 04, 2019"},"68":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/china-suspects-detained-canadian-spying-state-media-002142469.html","title":"China suspects detained Canadian of spying: state media","clust":2,"description":"China suspects detained former Canadian diplomat Michael Kovrig of spying and stealing state secrets, state media reported Monday, amid tensions between Ottawa and Beijing over the possible extradition of a top Huawei executive. Another Canadian in detention …","date":"Mar 04, 2019"},"69":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/cisco-ceo-suggests-fears-huawei-181700597.html","title":"Cisco CEO Suggests Fear of Huawei 5G Dominance Is Overblown","clust":2,"description":"“The current infrastructure around the world is built on a combination of communication suppliers from Europe, from China, from the U.S., everywhere,” Robbins said in a CNN interview on Sunday. The U.S. is seeking to discourage purchases of equipment from Hua…","date":"Mar 03, 2019"},"70":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/u-charm-offensive-chinas-huawei-launches-ad-combat-211055227--sector.html","title":"In U.S. charm offensive, China's Huawei launches ad to combat dark image","clust":2,"description":"Huawei Technologies ran a full page ad in major U.S. newspapers on Thursday urging readers not to believe \"everything you hear,\" about the Chinese tech firm, as it defends itself against government accusations its equipment can be used to spy. The world's lar…","date":"Feb 28, 2019"},"71":{"sourceName":"yahoo","url":"https:\/\/news.yahoo.com\/top-asian-news-5-01-m-gmt-050150338.html","title":"Top Asian News 5:01 a.m. GMT","clust":2,"description":"TAIPEI, Taiwan (AP) — A strike among pilots at Taiwan's flag carrier China Airlines dragged into a third day Sunday, resulting in further flight cancellations. There was no immediate word of a settlement as the pilots' union remained firm in its demands for a…","date":"Feb 10, 2019"},"72":{"sourceName":"marketwatch","url":"https:\/\/www.marketwatch.com\/story\/huawei-founder-defiant-in-face-of-pressure-theres-no-way-the-us-can-crush-us-2019-02-19","title":"Key Words: Huawei founder defiant in face of pressure: ‘There’s no way the U.S. can crush us’","clust":1,"description":"Huawei Technology Co.’s founder offered a defiant defense of his company, as the Chinese telecom giant faces mounting opposition from the U.S. and its allies over national security concerns.","date":"Feb 20, 2019"},"73":{"sourceName":"appleinsider","url":"https:\/\/appleinsider.com\/articles\/19\/03\/06\/huawei-sues-us-government-says-purchasing-ban-unconstitutional","title":"Huawei sues U.S. government, says purchasing ban unconstitutional","clust":1,"description":"Chinese smartphone and communications equipment manufacturer Huawei on Thursday local time followed through with threats to sue the U.S. government over legislation that bars government agencies from buying its products.","date":"Mar 07, 2019"},"74":{"sourceName":"cnet","url":"https:\/\/www.cnet.com\/news\/extradition-hearing-for-huawei-cfo-gets-go-ahead-from-canada\/","title":"Extradition hearing for Huawei CFO gets go-ahead from Canada - CNET","clust":2,"description":"The country's department of justice says there's enough evidence for a hearing on whether Meng Wanzhou should be extradited to the US.","date":"Mar 01, 2019"},"75":{"sourceName":"cnet","url":"https:\/\/www.cnet.com\/news\/huawei-founder-says-daughters-arrest-was-politically-motivated\/","title":"Huawei founder says daughter's arrest was 'politically motivated' - CNET","clust":2,"description":"Ren Zhengfei also says his company is \"as small as a tomato\" in the tension between the US and China.","date":"Feb 20, 2019"},"76":{"sourceName":"cnet","url":"https:\/\/www.cnet.com\/news\/huawei-reportedly-calls-for-international-cybersecurity-standards\/","title":"Huawei reportedly calls for international cybersecurity standards - CNET","clust":1,"description":"The US has banned some Huawei technology over security concerns.","date":"Mar 05, 2019"},"77":{"sourceName":"cnet","url":"https:\/\/www.cnet.com\/news\/forget-galaxy-fold-5g-and-foldable-phones-go-big-at-mwc-2019\/","title":"Forget Galaxy Fold: 5G and foldable phones go big at MWC 2019 - CNET","clust":0,"description":"With international intrigue and a 5G coming-out party, this show doesn’t need the boost of a Samsung event.","date":"Feb 22, 2019"},"78":{"sourceName":"theregister","url":"https:\/\/www.theregister.co.uk\/2019\/02\/25\/huawei_us_electric_grid\/","title":"Jeez, what a Huawei to go: Now US senators want Chinese kit ripped out of national leccy grid","clust":0,"description":"Red scare reaches new heights as intel committee urges further crackdown on network-connected gear Equipment made by Chinese electronics giant Huawei could be torn out of America's electrical grid, if US senators get their way.…","date":"Feb 25, 2019"},"79":{"sourceName":"theregister","url":"https:\/\/www.theregister.co.uk\/2019\/03\/07\/huawei_sues_us_government\/","title":"Damn you, America, you won't get Huawei with this! Chinese giant sues US government over 'unconstitutional' ban","clust":1,"description":"Hardware maker goes to Texas to overturn banishment of its IT gear from federal networks Huawei is suing Uncle Sam to overturn a ban on its communications hardware in US federal government computer networks.…","date":"Mar 07, 2019"},"80":{"sourceName":"theregister","url":"https:\/\/www.theregister.co.uk\/2019\/03\/01\/huawei_secret_theft_claims\/","title":"Huawei to the danger zone, ride into the danger zone... Chinese giant denies America's secrets theft, fraud charges","clust":2,"description":"Chinese phone, telco kit maker pleads not guilty in row over vanished T-Mob Tappy robot Chinese hardware maker Huawei pleaded not guilty to charges of conspiracy to steal trade secrets, attempted theft of trade secrets, wire fraud, and obstruction of justice,…","date":"Mar 01, 2019"},"81":{"sourceName":"phandroid","url":"https:\/\/phandroid.com\/2019\/03\/01\/huawei-pleads-not-guilty-to-trade-secret-theft-charges-in-us-federal-court\/","title":"Huawei pleads ‘not guilty’ to trade-secret theft charges in US Federal Court","clust":2,"description":"Huawei has pleaded not guilty to a handful of charges which accuse the company of trade-secret theft, fire fraud and obstruction of justice in US federal court in Seattle. The company was found guilty of stealing T-Mobile trade secrets in 2017 and was ordered…","date":"Mar 01, 2019"},"82":{"sourceName":"engadget","url":"https:\/\/www.engadget.com\/2019\/02\/28\/huawei-pleads-not-guilty-to-stealing-us-trade-secrets\/","title":"Huawei pleads not guilty to stealing US trade secrets","clust":2,"description":"In a US federal court in Seattle, Chinese tech firm Huawei pleaded not guilty to several charges that allege the company engaged or attempted to engage in theft of trade secrets, the Associated Press reported. US District Judge Richardo S. Martinez,...","date":"Feb 28, 2019"},"83":{"sourceName":"androidauthority","url":"https:\/\/www.androidauthority.com\/no-way-us-crush-huawei-founder-955429\/","title":"There’s no way the US can crush us, says Huawei founder","clust":1,"description":"Huawei founder Ren Zhengfei also claimed that his daughter's arrest was politically motivated.","date":"Feb 19, 2019"},"84":{"sourceName":"androidauthority","url":"https:\/\/www.androidauthority.com\/usa-ban-china-equipment-mwc-951736\/","title":"Trump tipped to ban Chinese telecom equipment ahead of MWC","clust":2,"description":"It looks like Huawei and ZTE could be in for an awkward MWC...","date":"Feb 08, 2019"},"85":{"sourceName":"androidcommunity","url":"https:\/\/androidcommunity.com\/huawei-will-reportedly-file-suit-against-us-government-20190304\/","title":"Huawei will reportedly file suit against US government","clust":2,"description":"If you think that Huawei will take all the things that the U.S. government is saying about them sitting down, well you’re apparently wrong. Reports are coming in that the Chinese OEM is preparing to file a lawsuit against the government that continues to camp…","date":"Mar 05, 2019"},"86":{"sourceName":"bgr","url":"https:\/\/bgr.com\/2019\/03\/04\/huawei-us-ban-lawsuit\/","title":"Huawei has had enough, reportedly plans to file suit against the US","clust":0,"description":"A new chapter in the ongoing flap between the US and Huawei is about to get under way, with the Chinese smartphone maker reportedly planning a lawsuit to be filed against the US government later this week in Texas. That's where the company's US office is loca…","date":"Mar 05, 2019"},"87":{"sourceName":"bgr","url":"https:\/\/bgr.com\/2019\/02\/19\/huawei-founder-interview-defiant-response\/","title":"Huawei founder strikes defiant tone in interview, says the US ‘can’t crush us’","clust":1,"description":"In his first interview since the arrest of his daughter in December, Huawei's until-now reclusive founder struck a defiant tone in response to questions from the BBC -- with the billionaire businessman promising the news service that there's \"no way the US ca…","date":"Feb 19, 2019"},"88":{"sourceName":"vox","url":"https:\/\/www.vox.com\/vox-sentences\/2019\/3\/1\/18246832\/vox-sentences-jared-kushner-security-clearance","title":"Vox Sentences: Kushner’s security clearance secrets","clust":2,"description":"Jared Kushner’s clearance level raises questions; Canada’s prime minister faces an ill-timed accusation.","date":"Mar 02, 2019"},"89":{"sourceName":"techmeme","url":"https:\/\/www.techmeme.com\/190306\/p26","title":"Sources detail timeline of US scrutiny of Huawei, spurred by Reuters' report from 2012, and how execs' info has been collected at airport screenings for years (Karen Freifeld\/Reuters)","clust":2,"description":"Karen Freifeld \/ Reuters : Sources detail timeline of US scrutiny of Huawei, spurred by Reuters' report from 2012, and how execs' info has been collected at airport screenings for years — (Reuters) - The surprise arrest of Huawei's chief financial officer in …","date":"Mar 06, 2019"},"90":{"sourceName":"politico","url":"https:\/\/www.politico.com\/story\/2019\/03\/03\/huawei-sues-canada-1232658","title":"Huawei exec sues Canada over detention","clust":1,"description":"Meng's civil claim alleges that Canadian authorities held and interrogated her before notifying her that she was under arrest.","date":"Mar 03, 2019"},"91":{"sourceName":"politico","url":"https:\/\/www.politico.com\/story\/2019\/03\/01\/canada-extradition-huawei-executive-1186525","title":"Canada approves extradition process for Huawei executive","clust":2,"description":"Canadian officials conducted a 'thorough and diligent review of the evidence' and determined it was sufficient to present the case to a judge for extradition.","date":"Mar 01, 2019"},"92":{"sourceName":"politico","url":"https:\/\/www.politico.com\/story\/2019\/02\/22\/trump-huawei-china-trade-talks-1206627","title":"Trump says Huawei charges on the table in China trade talks","clust":0,"description":"This isn't the first time Trump has used penalties on a Chinese company as a tool to advance his trade agenda.","date":"Feb 22, 2019"},"93":{"sourceName":"recode","url":"https:\/\/www.recode.net\/2019\/3\/5\/18250743\/china-huawei-lawsuit-meng-wanzhou-canada-podcasts-luminary-disney-iger-executive-pay-ai-diet-elder","title":"Recode Daily: China’s Huawei prepares to sue the US government; its CFO has already sued Canada","clust":2,"description":"Plus: Congressional Democrats unveil legislation to reinstate net neutrality rules; with an all-star slate of creators, the Luminary app wants to be the Netflix of podcasts; the AI diet.","date":"Mar 05, 2019"},"94":{"sourceName":"recode","url":"https:\/\/www.recode.net\/2019\/2\/20\/18232558\/emoji-court-interpret-smart-speaker-amazon-google-trump-space-force-huawei-uber-nyc-kiss-theme-park","title":"Recode Daily: Emoji are increasingly popping up in US court cases — and courts aren’t prepared to interpret them","clust":2,"description":"Plus: Amazon beat Google in Q4 smart speaker shipments; Trump signs the US Space Force into existence; the spectacular failure of the world’s only hard rock theme park.","date":"Feb 20, 2019"},"95":{"sourceName":"bbc","url":"https:\/\/www.bbc.com\/news\/resources\/idt-sh\/Huawei","title":"The World's Most Controversial Company","clust":2,"description":"Soon 5G mobile internet will be everywhere. Huawei is a pioneer but is accused of being a gateway for China to spy on Western nations. Is the firm guilty? Or the victim of unfair rumors?","date":"Mar 06, 2019"},"96":{"sourceName":"aljazeera","url":"https:\/\/www.aljazeera.com\/news\/2019\/03\/canada-approves-extradition-hearing-top-huawei-executive-190301192852605.html","title":"Canada approves extradition hearing against top Huawei executive","clust":2,"description":"Ottawa says it will allow an extradition hearing to proceed against Meng Wanzhou, the CFO of Chinese tech giant Huawei.","date":"Mar 01, 2019"}}