{"0":{"sourceName":"lifehacker","url":"https:\/\/lifehacker.com\/people-with-disabilities-are-entitled-to-a-free-lifetim-1832699399","title":"People With Disabilities Are Entitled to a Free Lifetime Pass to National Parks","clust":0,"description":"If you or your child has a permanent disability you may be entitled to a free, lifetime pass to visit the National Parks and Federal Recreational Lands. Read more...","date":"Feb 18, 2019"},"1":{"sourceName":"lifehacker","url":"https:\/\/lifehacker.com\/disabled-people-are-entitled-to-a-free-lifetime-pass-to-1832699399","title":"Disabled People Are Entitled to a Free Lifetime Pass to National Parks","clust":0,"description":"If you or your child has a permanent disability you may be entitled to a free, lifetime pass to visit the National Parks and Federal Recreational Lands. Read more...","date":"Feb 18, 2019"},"2":{"sourceName":"engadget","url":"https:\/\/www.engadget.com\/2019\/02\/28\/russia-putin-internet-kill-switch-cybersecurity\/","title":"Russia is going to test an internet ‘kill switch’ and its citizens will suffer","clust":0,"description":"Russia is planning to disconnect itself from the global internet in a test sometime between now and April. The country says it is implementing an internal internet (intranet) and an internet \"kill switch\" to protect itself against cyberwar. The question is, w…","date":"Feb 28, 2019"},"3":{"sourceName":"engadget","url":"https:\/\/www.engadget.com\/2019\/02\/07\/spacex-first-crew-dragon-flight-march-2nd\/","title":"SpaceX postpones first Crew Dragon flight until March 2nd","clust":4,"description":"SpaceX and NASA have set a new target date for the Crew Dragon's first test flight: March 2nd. The capsule was supposed to blast off on top of a Falcon 9 rocket and head to the ISS for the first time on January 7th, but the partners rescheduled it twice since…","date":"Feb 07, 2019"},"4":{"sourceName":"wired","url":"https:\/\/www.wired.com\/story\/database-leak-details-chinas-oppressive-tracking-of-muslims-security-roundup\/","title":"Chinese Surveillance, Facebook Tracking, and More Security News This Week","clust":0,"description":"3-D printed rifles, Iran missile hacking, and more of the week's top security news.","date":"Feb 16, 2019"},"5":{"sourceName":"wired","url":"https:\/\/www.wired.com\/story\/the-pentagon-needs-to-woo-ai-experts-away-from-big-tech\/","title":"The Pentagon Needs to Woo AI Experts Away From Big Tech","clust":0,"description":"Opinion: Without more DOD investment, there just aren’t enough incentives to lure talent away from high-paying jobs with great benefits into a life of public service.","date":"Feb 16, 2019"},"6":{"sourceName":"wired","url":"https:\/\/www.wired.com\/story\/congress-spending-bill-wall-money-border-tech\/","title":"Instead of a Wall, Congress Puts Border Money Where It Counts","clust":4,"description":"President Trump has yet to sign the bill. If he doesn't, another government shutdown looms.","date":"Feb 14, 2019"},"7":{"sourceName":"wired","url":"https:\/\/www.wired.com\/story\/government-shutdown-cybersecurity-recovery\/","title":"Cybersecurity Workers Scramble to Fix a Post-Shutdown Mess","clust":0,"description":"The shutdown may have ended two weeks ago, but federal cybersecurity professionals will be coping with its impact for a long time to come.","date":"Feb 10, 2019"},"8":{"sourceName":"wired","url":"https:\/\/www.wired.com\/story\/the-governments-new-weather-model-faces-a-storm-of-protest\/","title":"The Government's New Weather Model Faces a Storm of Protest","clust":0,"description":"The National Weather Service will soon introduce a new forecasting model, but meteorologists are saying it's worse than its predecessor.","date":"Feb 19, 2019"},"9":{"sourceName":"theverge","url":"https:\/\/www.theverge.com\/interface\/2019\/2\/14\/18224126\/facebook-antivax-reddit-groups-forums-fight","title":"How the fight over vaccines is fueled by web forums","clust":0,"description":"Facebook Groups promotes anti-vaccine communities — but Reddit is fighting back","date":"Feb 14, 2019"},"10":{"sourceName":"techcrunch","url":"http:\/\/techcrunch.com\/2019\/02\/20\/uks-extended-5km-airport-drone-no-fly-zones-in-force-next-month\/","title":"UK’s extended 5km airport drone ‘no-fly’ zones in force next month","clust":0,"description":"The UK’s Department for Transport has said today that an expansion of drone ‘no-fly’ zones to 5km around airport runways will come into force on March 13. Anyone caught and convicted of flying a drone inside the restricted zones could face a fine and years in…","date":"Feb 20, 2019"},"11":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/to-stop-the-wall-democrats-agree-to-fund-mass-surveill-1832633266","title":"To Stop the Wall, Democrats Agree to Fund Mass Surveillance Near U.S. Border","clust":0,"description":"A spending bill expected to pass the House and Senate on Thursday, and then be signed by President Trump before this weekend to avert another disastrous government shutdown, contains $100 million earmarked for the development of surveillance technology such a…","date":"Feb 14, 2019"},"12":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/tech-genius-donald-trump-to-sign-executive-order-on-art-1832522701","title":"Tech Genius Donald Trump to Sign Executive Order on Artificial Intelligence Today","clust":0,"description":"President Donald Trump reportedly plans to sign an executive order today creating something called the American AI Initiative. The executive order is apparently a symbolic nod to artificial intelligence that doesn’t create any new funding but encourages the f…","date":"Feb 11, 2019"},"13":{"sourceName":"gizmodo","url":"https:\/\/gizmodo.com\/the-tsa-found-an-average-of-11-guns-a-day-in-carry-on-b-1832460316","title":"The TSA Found an Average of 11 Guns a Day in Carry-On Bags Last Year","clust":0,"description":"Americans broke a new record last year, but it’s nothing to write home about. The Transportation Security Administration (TSA) found 4,239 firearms in carry-on luggage in 2018, breaking the previous record that was set in 2017. That’s an average of more than …","date":"Feb 08, 2019"},"14":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/11\/us\/politics\/donald-trump-el-paso.html","title":"Trump to Champion Border Wall at Rally in El Paso, While Opponents There March in Protest","clust":4,"description":"President Trump’s rally, his first since a debate over funding of the wall shut down the government, comes as negotiations to head off another shutdown are in danger of collapse.","date":"Feb 11, 2019"},"15":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/13\/us\/politics\/government-shutdown-donald-trump.html","title":"Trump Says He Does Not Want a Government Shutdown as He Moves Toward Embracing Border Deal","clust":0,"description":"Speaker Nancy Pelosi at the Capitol today. “As with all compromises, I say to people, support the bill for what is in it,” Ms. Pelosi said Wednesday. “Don’t judge it for what is not in it.”","date":"Feb 13, 2019"},"16":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/10\/us\/politics\/trump-border-wall.html","title":"Talks Over Border Security Break Down, Imperiling Effort to Prevent Shutdown","clust":0,"description":"Lawmakers and aides familiar with the negotiations said the number of beds for housing detained migrants already in the country was the main sticking point.","date":"Feb 10, 2019"},"17":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/12\/opinion\/bezos-trump-pecker.html","title":"The Conversation: The Bezos Story Is Big","clust":4,"description":"And it’s got a little bit of everything.","date":"Feb 12, 2019"},"18":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/15\/us\/politics\/trump-border-emergency-announcement.html","title":"White House Memo: Trump Follows Familiar Playbook When Confronted by a Loss: Distract and Digress","clust":0,"description":"“So, I’m going to be signing a national emergency,” the president said, almost as an afterthought at the news conference whose purpose was ostensibly to announce that news.","date":"Feb 16, 2019"},"19":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/12\/opinion\/trump-border-wall-deal.html","title":"Deal or No Deal, Mr. Trump?","clust":0,"description":"President Trump making a case for the border wall at a campaign rally in El Paso on Monday.","date":"Feb 13, 2019"},"20":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/07\/opinion\/north-pole-gps.html","title":"The Wandering North Pole","clust":0,"description":"The north magnetic pole is moving eastward at an accelerating pace. Is doomsday nigh?","date":"Feb 08, 2019"},"21":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/10\/us\/trump-el-paso-rally.html","title":"El Paso’s Message for Trump Before Rally: Don’t Speak for Us","clust":4,"description":"A young woman and her friends celebrate her quinceañera by posing for photographs at an overlook in El Paso. The tension surrounding President Trump’s planned visit to the city on Monday is revealing political fissures.","date":"Feb 10, 2019"},"22":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/13\/us\/politics\/deal-government-shutdown.html","title":"News Analysis: Trump Puts Best Face on Border Deal, as Aides Try to Assuage an Angry Right","clust":0,"description":"It was arguably the most punishing defeat President Trump has experienced in office, and it left the White House scrounging for other ways to pay for a wall.","date":"Feb 14, 2019"},"23":{"sourceName":"mashable","url":"https:\/\/mashable.com\/video\/stephen-colbert-trump-national-emergency\/","title":"Stephen Colbert calls Trump’s national emergency plan 'insane'","clust":3,"description":"Donald Trump is set to declare a national emergency in order to unlock $8 billion in additional funds for his border wall, on top of the lowered $1.375 billion allocated in a bipartisan budget bill the president is also expected to sign. The Late Show host St…","date":"Feb 15, 2019"},"24":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/12\/us\/politics\/government-shutdown-deal.html","title":"Five Key Takeaways From the Tentative Deal on Border Security","clust":0,"description":"Congressional negotiators have come up with a tentative deal to avert a government shutdown. Here are some key takeaways.","date":"Feb 12, 2019"},"25":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/14\/arts\/television\/stephen-colbert-government-shutdown-trump.html","title":"Best of Late Night: Stephen Colbert Would Like to See the Government Do Something","clust":0,"description":"Stephen Colbert is glad that another government shutdown looks unlikely, but he isn’t celebrating “that they’re close to a deal to achieve the absolute minimum.”","date":"Feb 14, 2019"},"26":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/15\/us\/politics\/border-wall-deal.html","title":"In a Divided Washington, Congress Averted a Shutdown — but at a Price","clust":4,"description":"President Trump’s last-minute tantrum nearly derailed a deal to avert another government shutdown, and forced the Senate majority leader, Mitch McConnell, to accept an emergency declaration.","date":"Feb 15, 2019"},"27":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/14\/us\/politics\/congress-trump-border-deal-wall.html","title":"Congress Expected to Swiftly Pass Border Deal to Prevent Shutdown","clust":0,"description":"Congress is expected to pass legislation to fund the government, depriving President Trump of the funds needed to build a wall along the southern border with Mexico.","date":"Feb 14, 2019"},"28":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/12\/your-money\/irs-government-shutdown.html","title":"The Government Shutdown Made the I.R.S. Even More Frustrating to Deal With","clust":0,"description":"Fewer taxpayer calls are being answered and wait times are longer, a new report finds.","date":"Feb 12, 2019"},"29":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/25\/nyregion\/newyorktoday\/ny-news-subway-delays-trains.html","title":"New York Today: N.Y. Today: Think the L Train Disruption Has Nothing to Do With You? Think Again.","clust":0,"description":"Monday: The partial shutdown of the subway line may be a preview of what lies ahead for the system.","date":"Feb 25, 2019"},"30":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/11\/us\/politics\/immigration-detention-beds-ice-trump.html","title":"Immigration Talks Move From Wall to Real Fight: How to Enforce the Law","clust":0,"description":"The fight over detention beds under President Trump’s control goes to the heart of the immigration issue: Should undocumented immigrants be swept up indiscriminately?","date":"Feb 12, 2019"},"31":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/08\/us\/politics\/government-shutdown-deal.html","title":"Trump Shows Flexibility on Wall as Border Deal Comes into View","clust":0,"description":"Senator Richard Shelby, Representative Nita M. Lowey, Representative Kay Granger, and Senator Patrick J. Leahy spoke during the joint conference committee on border funding last week.","date":"Feb 08, 2019"},"32":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/15\/us\/politics\/emergency-border-wall.html","title":"Key Takeaways From Trump’s Decision to Use a National Emergency to Build a Border Wall","clust":0,"description":"President Trump has set a course to deliver on a core promise to his supporters, a border wall with Mexico. But the path he chose, declaring a national emergency, is perilous.","date":"Feb 15, 2019"},"33":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/20\/magazine\/pelosi-trump-and-the-spectacle-of-red-meat-politics.html","title":"Screenland: Pelosi, Trump and the Spectacle of Red Meat Politics","clust":0,"description":"He tries to drop an anvil on her. She lures him over a cliff. We care about the nation’s health, but we seem to enjoy the anvil business even more.","date":"Feb 20, 2019"},"34":{"sourceName":"nytimes","url":"https:\/\/www.nytimes.com\/2019\/02\/11\/opinion\/democrats-border-security-wall.html","title":"The Case Against ‘Border Security’","clust":0,"description":"Protesters gathered on the American side of the border against a new construction plan for about 34km of steel wall between Santa Teresa, New Mexico, and Ejido San Jeronimo, Mexico last June.","date":"Feb 11, 2019"},"35":{"sourceName":"bbc","url":"https:\/\/www.bbc.co.uk\/news\/world-us-canada-47218625","title":"BBC asks White House for security review after Trump rally attack","clust":0,"description":"The request to review security came after a BBC cameraman was shoved at an Trump rally in El Paso.","date":"Feb 12, 2019"},"36":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/videos\/politics\/2019\/02\/06\/trump-state-of-the-union-shutdown-kaitlan-collins-dnt-lead-vpx.cnn","title":"Clock ticking on compromise to prevent another shutdown","clust":4,"description":"With the State of the Union behind him, President Trump is facing another possible government shutdown. CNN's Kaitlan Collins reports.","date":"Feb 06, 2019"},"37":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/videos\/politics\/2019\/02\/12\/gerry-connolly-shutdown-negotiations-agreement-sot-ctn-vpx.cnn","title":"Lawmaker: Trump learned the hard way last shutdown","clust":0,"description":"CNN's Don Lemon talks to Rep. Gerry Connolly (D-VA) about a possible agreement reached between negotiators to avert a second partial government shutdown.","date":"Feb 12, 2019"},"38":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/videos\/politics\/2019\/02\/10\/sotu-cheney-shutdown.cnn","title":"Rep. Cheney: Certainly hope there's not another shutdown","clust":0,"description":"Rep. Liz Cheney tells Jake Tapper that she hopes the government won't shutdown and that Democrats and Republicans can come to a bipartisan agreement to secure the border.","date":"Feb 10, 2019"},"39":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/videos\/politics\/2019\/02\/15\/cuomo-lemon-handoff-valentines-day-shutdown-cpt-vpx.cnn","title":"Lemon, Cuomo share Valentine's Day message","clust":0,"description":"CNN's Chris Cuomo and Don Lemon share a message on Valentine's Day after the House and Senate approved a spending deal to avert a government shutdown.","date":"Feb 15, 2019"},"40":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/12\/politics\/irs-shutdown-service-delays\/index.html","title":"Internal IRS report details 'shocking' service delays and backlogs after shutdown","clust":0,"description":"The Internal Revenue Service accumulated a backlog of 5 million unsorted pieces of mail during the five-week government shutdown, according to an agency watchdog report released Tuesday.","date":"Feb 12, 2019"},"41":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/13\/politics\/trump-border-security-deal\/index.html","title":"The President intends to sign the deal, two sources who have spoken directly with him tell CNN","clust":0,"description":"President Donald Trump intends to sign the border security deal to avoid another partial government shutdown, according to two sources who have spoke directly with the President.","date":"Feb 13, 2019"},"42":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/11\/politics\/shutdown-negotiations-agreement-reached-congress-border-security\/index.html","title":"Congressional negotiators have a reached a deal in principle and plan to draft a final agreement on Tuesday","clust":3,"description":"Congressional negotiators say they have reached an agreement in principle to avert a government shutdown at the end of this week.","date":"Feb 12, 2019"},"43":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/11\/politics\/treasury-irs-tax-refund-second-shutdown\/index.html","title":"Treasury says you'll get your refund even if there's a shutdown","clust":0,"description":"The Trump administration is taking steps to make sure American taxpayers won't feel the impact if the White House and Congress can't avert a second partial government shutdown this week.","date":"Feb 11, 2019"},"44":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/14\/politics\/congress-republicans-national-emergency\/index.html","title":"Republicans warn Trump against decision to declare emergency to build border wall","clust":4,"description":"President Donald Trump will sign a bill to avert another government shutdown, but also issue a national emergency declaration to build a wall on the US southern border, according to Senate Majority Leader Mitch McConnell, replacing lawmakers' most pressing pr…","date":"Feb 15, 2019"},"45":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/14\/politics\/donald-trump-wall-negotiations-spending-bill\/index.html","title":"Trump privately gripes that Democrats outplayed the GOP","clust":1,"description":"President Donald Trump appears to be moving -- unhappily -- closer to signing a bipartisan agreement that provides only a fraction of the money he demanded for a border wall. But in conversations with allies over the past days, he has griped that Republican n…","date":"Feb 14, 2019"},"46":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/07\/politics\/would-trump-sign-border-security-bill\/index.html","title":"No one knows if Trump will sign a border funding bill","clust":1,"description":"It's the only thing that matters, and yet, Republicans -- even lead negotiators -- have little guarantee that President Donald Trump will sign any border deal they can pull together.","date":"Feb 07, 2019"},"47":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/11\/politics\/ice-detention-immigration\/index.html","title":"Budget talks sticking point: How many people ICE can detain","clust":0,"description":"Border security talks hit an impasse over the weekend, as Democrats pushed back against another facet of the Trump administration's agenda to crack down on immigration: aggressive detention efforts by the Immigration and Customs Enforcement.","date":"Feb 11, 2019"},"48":{"sourceName":"cnn","url":"https:\/\/www.cnn.com\/2019\/02\/06\/opinions\/state-of-the-union-optics-silva-mcgowan\/index.html","title":"The bizarre optics of the State of the Union","clust":4,"description":"Donald Trump strode into the House chamber Tuesday night off balance in every way. His dangling red tie was not centered, his left hand fell limp at his side while the right actively pressed the flesh of adoring GOP lawmakers. Even his attempt at a smile look…","date":"Feb 06, 2019"},"49":{"sourceName":"bbc","url":"https:\/\/www.bbc.co.uk\/news\/world-us-canada-47191959","title":"US shutdown talks stall ahead of deadline","clust":0,"description":"Members of Congress had targeted agreement by Monday to be sure of hitting Friday's deadline.","date":"Feb 10, 2019"},"50":{"sourceName":"bbc","url":"https:\/\/www.bbc.co.uk\/news\/world-us-canada-47360982","title":"Ex-security officials: 'No factual basis' for Trump wall","clust":4,"description":"Security veterans from both parties will say \"there is no factual basis\" for a border emergency.","date":"Feb 25, 2019"},"51":{"sourceName":"bbc","url":"https:\/\/www.bbc.co.uk\/news\/world-us-canada-47208909","title":"Trump supporter attacks BBC cameraman at El Paso rally","clust":4,"description":"Mr Trump saw the attack and confirmed the cameraman was well with a thumbs up after it happened.","date":"Feb 12, 2019"},"52":{"sourceName":"arstechnica","url":"https:\/\/arstechnica.com\/science\/2019\/02\/nasa-still-working-toward-2020-launch-of-massive-sls-rocket\/","title":"NASA “still working toward” 2020 launch of massive SLS rocket","clust":0,"description":"Multiple concerns remain: cost, schedule, management, delayed upper stage.","date":"Feb 06, 2019"},"53":{"sourceName":"arstechnica","url":"https:\/\/arstechnica.com\/science\/2019\/02\/rocket-report-rogozins-crazy-promise-spacex-tests-mars-engine-sls-slips\/","title":"Rocket Report: Rogozin’s crazy promise, SpaceX tests Mars engine, SLS slips","clust":0,"description":"\"The workload is large, but I believe we can handle it.\"","date":"Feb 08, 2019"},"54":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trump-shutdown-idUSKCN1Q21I4","title":"Trump to sign border security deal to avert government shutdown: CNN","clust":0,"description":"Donald Trump plans to sign the border security deal reached by congressional negotiators in order to avoid another partial shutdown of the federal government, CNN reported on Wednesday, citing two sources who had spoken with the U.S. president.","date":"Feb 13, 2019"},"55":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-shutdown-trump-democrats-idUSKCN1Q02AY","title":"Trump says Democrats to blame if government shuts down again","clust":4,"description":"U.S. President Donald Trump on Monday said Democrats would be to blame if the government shuts down when a temporary funding bill expires on Friday.","date":"Feb 11, 2019"},"56":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-shutdown-idUSKCN1Q01NV","title":"Top U.S. congressional negotiators to meet Monday on border security-aide","clust":0,"description":"The top four Democratic and Republican negotiators in the U.S. Congress on border security funding were scheduled to meet later on Monday in an attempt to reach a deal that would avert another government shutdown by a Friday deadline.","date":"Feb 11, 2019"},"57":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/uk-usa-shutdown-idUSKCN1Q30KU","title":"U.S. Congress advances border security bill without Trump border wall","clust":0,"description":"The U.S. Congress on Thursday aimed to end a dispute over border security with legislation that would ignore President Donald Trump's request for $5.7 billion (£4.45 billion) to help build a wall on the U.S.-Mexico border but avoid a partial government shutdo…","date":"Feb 14, 2019"},"58":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-shutdown-senate-vote-idUSKCN1Q32WQ","title":"Senate passes border security bill, sends to House","clust":4,"description":"The U.S. Senate on Thursday voted overwhelmingly to avert another partial government shutdown with bipartisan spending legislation that funds new barriers for part of the U.S.-Mexico border, but not the $5.7 billion that President Donald Trump sought for a wa…","date":"Feb 14, 2019"},"59":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-shutdown-house-idUSKCN1Q403Z","title":"House advances border security funds toward final passage","clust":4,"description":"The U.S. House of Representatives on Thursday approved the rules for debating a bill to avert another partial federal government shutdown by funding several agencies but denying President Donald Trump's demand for $5.7 billion to build a wall on the U.S.-Mexi…","date":"Feb 15, 2019"},"60":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-shutdown-idUSKCN1PV2G2","title":"U.S. border officials don't share Trump's zeal for border wall: lawmakers","clust":0,"description":"U.S. Customs and Border Protection officials on Wednesday described a multi-pronged strategy for tightening the southern border with Mexico that did not focus mainly on a massive wall President Donald Trump demands, according to lawmakers who attended a class…","date":"Feb 06, 2019"},"61":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trump-challenge-idUSKCN1Q82VP","title":"Trump confident he will prevail against lawsuits over emergency declaration","clust":0,"description":"President Donald Trump expressed confidence on Tuesday that he would prevail against a lawsuit filed by 16 U.S. states seeking to block his declaration of a national emergency to fund a wall along the U.S. border with Mexico.","date":"Feb 19, 2019"},"62":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trump-congress-idUSKCN1QK0OP","title":"Democrats may have votes to block Trump's border emergency in U.S. Senate","clust":0,"description":"Republican U.S. Senator Rand Paul said he would vote in favor of a resolution to end President Donald Trump's U.S.-Mexico border emergency declaration, according to a media report, likely giving Democrats the votes to pass the measure in the Senate.","date":"Mar 03, 2019"},"63":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trade-china-businesses-idUSKCN1Q31AQ","title":"U.S. group says Trump trade tariffs cost businesses $2.7 billion in November","clust":0,"description":"U.S. businesses paid an additional $2.7 billion in tariffs in November 2018, according to data from a coalition of U.S. business groups fighting President Donald Trump's trade tariffs.","date":"Feb 14, 2019"},"64":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-india-kashmir-pakistan-idUSKCN1QK093","title":"India-Pakistan border quiet but Kashmir tense amid militancy crackdown","clust":0,"description":"As India and Pakistan seemingly dial down hostilities that brought the arch enemies to the brink of another war, a massive crackdown on militancy in the Indian-controlled Kashmir region is killing both militants and security personnel in big numbers.","date":"Mar 03, 2019"},"65":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-fed-instantview-idUSKCN1QF1W2","title":"Instant View: Powell - Fed remains patient deciding on further hikes","clust":4,"description":"Rising risks and recent soft data shouldn't prevent solid growth for the U.S. economy this year, but the Federal Reserve will remain \"patient\" in deciding on further interest rate hikes, Fed Chairman Jerome Powell said on Tuesday.","date":"Feb 26, 2019"},"66":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trump-protests-idUSKCN1Q01Y2","title":"O'Rourke, Trump to headline dueling Texas border town rallies","clust":0,"description":"Beto O’Rourke, the former Democratic Texas congressman who is considering a 2020 White House bid, will join a march Monday night to protest Republican President Donald Trump's rally at the same time in the border town of El Paso.","date":"Feb 11, 2019"},"67":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trump-challenge-idUSKCN1Q8022","title":"U.S. states sue Trump administration in showdown over border wall funds","clust":0,"description":"A coalition of 16 U.S. states led by California sued President Donald Trump's administration on Monday over his decision to declare a national emergency to obtain funds for building a wall along the U.S.-Mexico border.","date":"Feb 19, 2019"},"68":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trade-nafta-idUSKCN1PV2PJ","title":"Republican senators to Trump: Do not terminate NAFTA","clust":0,"description":"Republican senators on Wednesday urged the top U.S. trade negotiator to counsel President Donald Trump against formally terminating the North American Free Trade Agreement as a way to pressure Congress to act quickly to approve a replacement deal.","date":"Feb 06, 2019"},"69":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-economy-inflation-idUSKCN1Q21N1","title":"U.S. consumer prices unchanged in January","clust":0,"description":"U.S. consumer prices were unchanged for a third straight month in January, leading to the smallest annual increase in inflation in more than 1-1\/2 years, which could allow the Federal Reserve to hold interest rates steady for a while.","date":"Feb 13, 2019"},"70":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-global-markets-idUSKCN1Q4043","title":"Asian stocks slip after grim U.S. retail sales data","clust":0,"description":"Asian stocks slipped on Friday after grim U.S. retail sales figures raised fresh doubts about the strength of the U.S. economy, offsetting optimism on trade talks between the United States and China.","date":"Feb 15, 2019"},"71":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trump-congress-idUSKCN1QH2V1","title":"U.S. Senate weighs blocking Trump's border emergency gambit","clust":0,"description":"Congressional efforts to end President Donald Trump’s U.S.-Mexico border emergency declaration - an attempt by him to fund a border wall without approval from Congress - intensified on Thursday with the introduction of a bipartisan resolution to block him in …","date":"Feb 28, 2019"},"72":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-trump-congress-idUSKCN1QF0FX","title":"House set to vote to end Trump's border wall 'emergency'","clust":0,"description":"The U.S. House of Representatives votes on Tuesday on a resolution to terminate President Donald Trump’s declaration of a national emergency to build a wall on the border with Mexico.","date":"Feb 26, 2019"},"73":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-usa-economy-housingstarts-idUSKCN1QF1LQ","title":"U.S. housing starts fall to more than two-year low","clust":0,"description":"U.S. homebuilding tumbled to a more than two-year low in December as construction of both single and multi-family housing declined, the latest indication that the economy lost momentum in the fourth quarter.","date":"Feb 26, 2019"},"74":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/us-global-markets-idUSKCN1PZ0RL","title":"Asian shares in tight range ahead of U.S.-China trade talks","clust":0,"description":"Asian shares started the week on the backfoot on Monday as worries about global growth, U.S. politics and the ongoing Sino-U.S. tariff war kept investors cautious, while the safe-haven greenback held near a six-week top against major currencies.","date":"Feb 10, 2019"},"75":{"sourceName":"reuters","url":"https:\/\/www.reuters.com\/article\/uk-forex-poll-euro-idUSKCN1PW018","title":"Dollar's shine dulling, but other side not much brighter: Reuters poll","clust":4,"description":"The dollar is losing some of its appeal, according to strategists polled by Reuters, who said the U.S. currency's fortunes have reversed in line with the Federal Reserve taking a dovish turn on rate hikes.","date":"Feb 07, 2019"},"76":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/culture\/2019\/feb\/13\/jimmy-kimmel-trump-el-paso-rally-finish-wall","title":"Jimmy Kimmel: 'How do you finish a wall you haven’t started building yet?'","clust":0,"description":"Late-night hosts discussed Trump’s new rally chant, the bipartisan shutdown deal and tax cut frustrations Late-night hosts recapped both real-world and chant-world developments, from a tentative budget deal to “finish that wall”. Continue reading...","date":"Feb 13, 2019"},"77":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/food\/2019\/feb\/09\/chef-jose-andres-disaster-relief-puerto-rico","title":"Chef José Andrés: 'I wouldn't mind if they told me: you are the food tsar'","clust":0,"description":"The Michelin-starred mastermind behind a 31-restaurant empire gained a new level of recognition with his relief efforts in disaster-hit zones such as Puerto Rico A nonstop stream of people of different ages, races and genders gawked, high-fived or chatted exc…","date":"Feb 09, 2019"},"78":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/business\/2019\/feb\/11\/the-trade-war-with-china-is-top-strand-in-the-white-house-soap","title":"The trade war with China is top strand in the White House soap | Larry Elliott","clust":4,"description":"Donald Trump may be a ham actor but he’s got the whole world on tenterhooks now Art is supposed to hold a mirror up to society but in the case of Donald Trump the opposite is the case. Current events in the White House increasingly mirror the soap opera of th…","date":"Feb 11, 2019"},"79":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/world\/2019\/feb\/13\/belgian-pm-urges-talks-as-strike-cancels-flights-shuts-schools","title":"Belgian PM urges talks as strike cancels flights and shuts schools","clust":4,"description":"Call for unions and employers to negotiate amid 24-hour action over working conditions The Belgian prime minister has appealed to employers and trade unions to resume their negotiations over working conditions after a general strike forced the cancellation of…","date":"Feb 13, 2019"},"80":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/us-news\/2019\/mar\/01\/trump-travel-ban-visa-waiver-muslim","title":"Couples separated by Trump's travel ban put hopes in faulty visa waiver system","clust":0,"description":"Several organizations are suing the federal government on behalf of 36 people whose visa waivers were denied or delayed On their first date in April 2015, Fereshteh Abbasi and Chris Gibson couldn’t settle on a place to get drinks. Unable to think of a place, …","date":"Mar 01, 2019"},"81":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/world\/2019\/feb\/13\/wednesday-briefing-drinking-up-time-brexit-plot-spilled-in-brussels-bar","title":"Wednesday briefing: Drinking up time? Brexit plot spilled in Brussels","clust":0,"description":"Chief negotiator reveals delaying tactics in bar … El Chapo goes down … and George Monbiot on the dark money corrupting politics and public life Hello – Warren Murray presenting the news sifted and unbleached. Continue reading...","date":"Feb 13, 2019"},"82":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/books\/2019\/mar\/02\/why-donald-trump-could-win-again-by-dave-eggers","title":"Dave Eggers: why Donald Trump could win again","clust":0,"description":"The president’s El Paso rally should have been a tricky affair, with the wall, the shutdown, a counter-rally by local Democrat star Beto O’Rourke. But it was a night of wild surprises At the end of Trump rallies, order breaks down and people are tired. To tho…","date":"Mar 02, 2019"},"83":{"sourceName":"theguardian","url":"https:\/\/www.theguardian.com\/world\/2019\/feb\/15\/friday-briefing-donald-trump-to-declare-national-emergency","title":"Friday briefing: Donald Trump to declare national emergency","clust":4,"description":"President set to follow through on wall threat … students’ climate change strike begins … and man tells how he fought mountain lion to the death Good morning, it’s Warren Murray getting you off to a running start. Continue reading...","date":"Feb 15, 2019"},"84":{"sourceName":"cnet","url":"https:\/\/www.cnet.com\/news\/spacexs-crew-dragon-suffers-third-major-setback\/","title":"SpaceX's Crew Dragon suffers third major setback - CNET","clust":2,"description":"NASA wants to launch astronauts from US soil for the first time in years with Elon Musk and Boeing's help -- but it still needs time.","date":"Feb 07, 2019"},"85":{"sourceName":"foreignpolicy","url":"https:\/\/foreignpolicy.com\/2019\/02\/15\/trumps-emergency-declaration-is-slap-in-the-face-to-military-families\/","title":"Trump's national emergency declaration is a 'slap in the face to military families'","clust":0,"description":"Carlos Barria\/Reuters President Donald Trump's national-emergency declaration will allow him to tap military construction funds to pay for a border wall. Lawmakers have pledged to fight Trump's declaration in court. But Trump's move to siphon money away from …","date":"Feb 15, 2019"},"86":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/north-carolina-election-board-says-gop-operative-voter-fraud-2019-2","title":"North Carolina's elections director says there is evidence of significant voter fraud that helped a GOP candidate win","clust":0,"description":"Juli Leonard\/The News & Observer via AP, Pool North Carolina's elections director says a Republican operative conducted an illegal and well-funded ballot-harvesting operation during 2018 elections. State elections director Kim Strach's testimony came during a…","date":"Feb 18, 2019"},"87":{"sourceName":"npr","url":"https:\/\/www.npr.org\/2019\/02\/25\/697469745\/2020-census-preparations-were-slowed-by-the-partial-government-shutdown","title":"2020 Census Preparations Were Slowed By The Partial Government Shutdown","clust":0,"description":"The recent partial government shutdown delayed preparations for the 2020 head count, including for a field test of the controversial citizenship question, internal Census Bureau documents suggest.","date":"Feb 26, 2019"},"88":{"sourceName":"npr","url":"https:\/\/www.npr.org\/2019\/02\/10\/693135144\/border-security-funding-talks-stalled-government-shutdown-looms","title":"Border Security Funding Talks Stalled, Government Shutdown Looms","clust":0,"description":"If an agreement isn't reached by Friday at midnight, the government could partially shut down again, just three weeks after the end of a 35-day partial government shutdown.","date":"Feb 10, 2019"},"89":{"sourceName":"npr","url":"https:\/\/www.npr.org\/2019\/02\/14\/694647564\/congress-sprints-to-pass-border-security-package-with-trumps-support-unclear","title":"Congress Sprints To Pass Border Security Package With Trump's Support Unclear","clust":0,"description":"Congressional leaders are prepared to vote Thursday on a $333 billion bipartisan spending package to avoid the threat of a partial government shutdown.","date":"Feb 14, 2019"},"90":{"sourceName":"npr","url":"https:\/\/www.npr.org\/2019\/02\/20\/696491480\/house-democrats-plan-resolution-challenging-trump-s-emergency-declaration","title":"House Democrats Plan Resolution Challenging Trump's Emergency Declaration","clust":4,"description":"The Democratic majority is likely to approved the resolution and then the law says the Republican-controlled Senate would have to consider the measure too.","date":"Feb 21, 2019"},"91":{"sourceName":"npr","url":"https:\/\/www.npr.org\/2019\/02\/10\/693115073\/the-historic-chapel-at-the-heart-of-a-legal-fight-over-the-border-wall","title":"The Historic Chapel At The Heart Of A Legal Fight Over The Border Wall","clust":1,"description":"The town of Mission, Texas grew up around La Lomita chapel. Last week, the local Catholic diocese tried and failed to stop the government from surveying the chapel's land.","date":"Feb 10, 2019"},"92":{"sourceName":"npr","url":"https:\/\/www.npr.org\/2019\/02\/27\/696824206\/not-in-compliance-wilbur-ross-the-trump-official-who-keeps-watchdogs-up-at-night","title":"'Not In Compliance': Wilbur Ross, The Trump Official Who Keeps Watchdogs Up At Night","clust":1,"description":"In an extremely rare rebuke, a government ethics watchdog refused to certify Ross' recent financial disclosure. But he's still in office even as other Trump officials have resigned for ethical lapses.","date":"Feb 27, 2019"},"93":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/fox-news-hosts-influenced-trump-government-shutdown-report-2019-3","title":"Trump was reportedly swayed by Fox News hosts into almost shutting down the government","clust":0,"description":"Fox News hosts and guests have had a major influence on President Donald Trump's willingness to shut down the federal government, according to a new report from the New Yorker. On one occasion, criticism from Fox News hosts almost pushed the president to veto…","date":"Mar 04, 2019"},"94":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/government-shutdown-deal-struck-stock-markets-rally-2019-2","title":"Global markets bounce as US agrees deal to stop a fresh government shutdown","clust":0,"description":"Global stock markets are rallying for a second consecutive day Tuesday as investors take heart from news overnight that a fresh shutdown of the US government looks to have been averted. The fresh shutdown, which was set to begin Saturday, has been kicked down…","date":"Feb 12, 2019"},"95":{"sourceName":"thisisinsider","url":"https:\/\/www.thisisinsider.com\/furloughed-park-ranger-judith-smith-won-295-million-lottery-2019-2","title":"A park ranger won a $29.5 million lottery jackpot while she was furloughed during the government shutdown","clust":0,"description":"Judith Smith, of Bayonne, New Jersey, and her children, William Kenneth Smith and Sarah Jude Smith, were announced as lottery winners on Wednesday. They won the the $29.5 million jackpot on Dec. 17, 2018, but waited two months to pick up the winnings after co…","date":"Feb 21, 2019"},"96":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/what-you-need-to-know-about-border-security-compromise-2019-2","title":"Here’s what you need to know about the border security compromise that could avert another government shutdown","clust":0,"description":"The bipartisan conference committee unveiled their border security compromise late Wednesday night. The White House is currently reviewing the package, but President Trump is expected to sign it. The compromise was crafted to avert another government shutdown…","date":"Feb 14, 2019"},"97":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/trump-allies-bash-garbage-border-deal-without-full-fall-funding-2019-2","title":"Trump's staunchest allies are already bashing the 'garbage' bipartisan border deal that could stave off another government shutdown","clust":0,"description":"President Donald Trump's most vocal allies are already railing against a tentative deal a bipartisan group of lawmakers struck on Monday night. The deal would reportedly allocate just $1.375 billion towards the border wall — a far cry from the $5.7 billion Tr…","date":"Feb 12, 2019"},"98":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/trump-confidants-hannity-meadows-against-border-security-funding-deal-2019-2","title":"Some of Trump's confidants are already attacking the bipartisan border security deal and it could put the agreement in jeopardy","clust":0,"description":"The conference committee tasked with addressing border security before government funding runs dry reached an agreement late Monday night. President Trump's informal advisors and confidants outside the White House are already dismissing the proposal as insuff…","date":"Feb 12, 2019"},"99":{"sourceName":"businessinsider","url":"https:\/\/www.businessinsider.com\/trump-border-wall-funding-executive-order-unspent-federal-money-2019-2","title":"Trump reportedly wants to grab funds intended for disaster relief, military housing, and flood-control projects to pay for his border wall","clust":1,"description":"The Trump administration is mulling a new plan to secure funding for the border wall by reallocating existing federal money. The move would allow Trump to secure the funds without declaring a national emergency, and without triggering another government shutd…","date":"Feb 13, 2019"}}